; domain
(define (domain drawer-tableware-manipulation)
  (:requirements :strips :typing)

  (:types
    item        ; movable objects: mug, bowl, bottle, etc.
    container   ; openable storage receptacles: drawer, cabinet, etc.
    location    ; symbolic workspace locations
  )

  (:predicates
    (robot-at ?l - location)                 ; robot's current symbolic location
    (container-at ?c - container ?l - location) ; container's fixed location
    (open ?c - container)                    ; container is open
    (closed ?c - container)                  ; container is closed
    (in-container ?i - item ?c - container)  ; item stored inside a container
    (on-top ?i1 - item ?i2 - item)           ; i1 rests on top of i2
    (at ?i - item ?l - location)             ; free-standing item's location
    (clear ?i - item)                        ; nothing rests on top of item i
    (holding ?i - item)                      ; gripper currently holds i
    (hand-empty)                             ; gripper holds nothing
    (has-liquid ?i - item)                   ; item currently contains liquid
  )

  ;; ---------- Locomotion ----------
  (:action move
    :parameters (?from - location ?to - location)
    :precondition (robot-at ?from)
    :effect (and (not (robot-at ?from)) (robot-at ?to))
  )

  ;; ---------- Container operations ----------
  (:action open
    :parameters (?c - container ?l - location)
    :precondition (and (robot-at ?l) (container-at ?c ?l)
                        (closed ?c) (hand-empty))
    :effect (and (open ?c) (not (closed ?c)))
  )

  (:action close
    :parameters (?c - container ?l - location)
    :precondition (and (robot-at ?l) (container-at ?c ?l)
                        (open ?c) (hand-empty))
    :effect (and (closed ?c) (not (open ?c)))
  )

  ;; ---------- Grasping ----------
  ;; Grasp an item that is stacked on top of another item inside an open container
  (:action grasp-stacked
    :parameters (?i1 - item ?i2 - item ?c - container ?l - location)
    :precondition (and (robot-at ?l) (container-at ?c ?l) (open ?c)
                        (in-container ?i2 ?c) (on-top ?i1 ?i2)
                        (clear ?i1) (hand-empty))
    :effect (and (holding ?i1) (not (hand-empty))
                 (not (on-top ?i1 ?i2)) (clear ?i2))
  )

  ;; Grasp an item resting directly inside an open container
  (:action grasp-from-container
    :parameters (?i - item ?c - container ?l - location)
    :precondition (and (robot-at ?l) (container-at ?c ?l) (open ?c)
                        (in-container ?i ?c) (clear ?i) (hand-empty))
    :effect (and (holding ?i) (not (hand-empty))
                 (not (in-container ?i ?c)))
  )

  ;; Grasp an item resting freely on a surface/location
  (:action grasp-from-surface
    :parameters (?i - item ?l - location)
    :precondition (and (robot-at ?l) (at ?i ?l) (clear ?i) (hand-empty))
    :effect (and (holding ?i) (not (hand-empty)) (not (at ?i ?l)))
  )

  ;; ---------- Placing / Releasing ----------
  (:action place
    :parameters (?i - item ?l - location)
    :precondition (and (robot-at ?l) (holding ?i))
    :effect (at ?i ?l)
  )

  (:action release
    :parameters (?i - item)
    :precondition (holding ?i)
    :effect (and (not (holding ?i)) (hand-empty) (clear ?i))
  )

  ;; ---------- Pouring ----------
  (:action pour
    :parameters (?from - item ?to - item ?l - location)
    :precondition (and (robot-at ?l) (holding ?from)
                        (at ?to ?l) (has-liquid ?from))
    :effect (and (has-liquid ?to) (not (has-liquid ?from)))
  )
)

; problem
(define (problem drawer-tableware-scene)
  (:domain drawer-tableware-manipulation)

  (:objects
    mug bowl bottle - item
    drawer - container
    loc-drawer loc-mug-pos loc-bowl-pos loc-bottle-orig - location
  )

  (:init
    ;; container setup
    (container-at drawer loc-drawer)
    (closed drawer)

    ;; storage nesting: bowl in drawer, mug on top of bowl
    (in-container bowl drawer)
    (on-top mug bowl)
    (clear mug)

    ;; bottle standing on table
    (at bottle loc-bottle-orig)
    (clear bottle)
    (has-liquid bottle)

    ;; robot / gripper state
    (robot-at loc-bottle-orig)
    (hand-empty)
  )

  (:goal
    (and
      (at mug loc-mug-pos)
      (at bowl loc-bowl-pos)
      (closed drawer)
      (has-liquid mug)
      (at bottle loc-bottle-orig)
      (hand-empty)
    )
  )
)

; plan
1. (move loc-bottle-orig loc-drawer)
   deleted: (robot-at loc-bottle-orig)
   added: (robot-at loc-drawer)
   goals met: 3 of 6
2. (open drawer loc-drawer)
   deleted: (closed drawer)
   added: (open drawer)
   goals met: 2 of 6
3. (grasp-stacked mug bowl drawer loc-drawer)
   deleted: (hand-empty) (on-top mug bowl)
   added: (holding mug) (clear bowl)
   goals met: 1 of 6
4. (place mug loc-drawer)
   added: (at mug loc-drawer)
   goals met: 1 of 6
5. (release mug)
   deleted: (holding mug)
   added: (hand-empty)
   goals met: 2 of 6
6. (close drawer loc-drawer)
   deleted: (open drawer)
   added: (closed drawer)
   goals met: 3 of 6
7. (grasp-from-surface mug loc-drawer)
   deleted: (hand-empty) (at mug loc-drawer)
   added: (holding mug)
   goals met: 2 of 6
8. (move loc-drawer loc-bottle-orig)
   deleted: (robot-at loc-drawer)
   added: (robot-at loc-bottle-orig)
   goals met: 2 of 6
9. (move loc-bottle-orig loc-bowl-pos)
   deleted: (robot-at loc-bottle-orig)
   added: (robot-at loc-bowl-pos)
   goals met: 2 of 6
10. (move loc-bowl-pos loc-mug-pos)
   deleted: (robot-at loc-bowl-pos)
   added: (robot-at loc-mug-pos)
   goals met: 2 of 6
11. (place mug loc-mug-pos)
   added: (at mug loc-mug-pos)
   goals met: 3 of 6
12. (release mug)
   deleted: (holding mug)
   added: (hand-empty)
   goals met: 4 of 6
13. (move loc-mug-pos loc-drawer)
   deleted: (robot-at loc-mug-pos)
   added: (robot-at loc-drawer)
   goals met: 4 of 6
14. (open drawer loc-drawer)
   deleted: (closed drawer)
   added: (open drawer)
   goals met: 3 of 6
15. (grasp-from-container bowl drawer loc-drawer)
   deleted: (hand-empty) (in-container bowl drawer)
   added: (holding bowl)
   goals met: 2 of 6
16. (place bowl loc-drawer)
   added: (at bowl loc-drawer)
   goals met: 2 of 6
17. (release bowl)
   deleted: (holding bowl)
   added: (hand-empty)
   goals met: 3 of 6
18. (close drawer loc-drawer)
   deleted: (open drawer)
   added: (closed drawer)
   goals met: 4 of 6
19. (grasp-from-surface bowl loc-drawer)
   deleted: (hand-empty) (at bowl loc-drawer)
   added: (holding bowl)
   goals met: 3 of 6
20. (move loc-drawer loc-bottle-orig)
   deleted: (robot-at loc-drawer)
   added: (robot-at loc-bottle-orig)
   goals met: 3 of 6
21. (move loc-bottle-orig loc-bowl-pos)
   deleted: (robot-at loc-bottle-orig)
   added: (robot-at loc-bowl-pos)
   goals met: 3 of 6
22. (place bowl loc-bowl-pos)
   added: (at bowl loc-bowl-pos)
   goals met: 4 of 6
23. (release bowl)
   deleted: (holding bowl)
   added: (hand-empty)
   goals met: 5 of 6
24. (move loc-bowl-pos loc-bottle-orig)
   deleted: (robot-at loc-bowl-pos)
   added: (robot-at loc-bottle-orig)
   goals met: 5 of 6
25. (grasp-from-surface bottle loc-bottle-orig)
   deleted: (hand-empty) (at bottle loc-bottle-orig)
   added: (holding bottle)
   goals met: 3 of 6
26. (place bottle loc-bottle-orig)
   added: (at bottle loc-bottle-orig)
   goals met: 4 of 6
27. (move loc-bottle-orig loc-mug-pos)
   deleted: (robot-at loc-bottle-orig)
   added: (robot-at loc-mug-pos)
   goals met: 4 of 6
28. (pour bottle mug loc-mug-pos)
   deleted: (has-liquid bottle)
   added: (has-liquid mug)
   goals met: 5 of 6
29. (release bottle)
   deleted: (holding bottle)
   added: (hand-empty)
   goals met: 6 of 6
